БИТУправление_медицинским_центром_демо/src/Documents/ОбратнаяСвязь/ОбратнаяСвязь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбратнаяСвязь</name>
  <basedOn>Document.Рекламация</basedOn>
  <basedOn>Document.Событие</basedOn>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОбращения</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ОбъектыОбратнойСвязиКлиента</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРазбор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулировкаПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Формулировка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обоснованность</name>
    <type>
      <types>EnumRef.ОбоснованностьОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Enums/ТипОбъектаОбратнойСвязи/ТипОбъектаОбратнойСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОбъектаОбратнойСвязи</name>
  <enumValues>
    <name>НеУказывается</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ОбъектОбратнойСвязи</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ОбратнаяСвязь/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))
		И ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Клиент") <> Неопределено
	Тогда
		ЭтотОбъект.Клиент = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		ПроверяемыеРеквизиты.Добавить("Обоснованность");
	КонецЕсли;
	
	Если ТипОбращения.ТипОбъектаОбратнойСвязи = Перечисления.ТипОбъектаОбратнойСвязи.НеУказывается Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОбъектОбращения"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
